reddit_clone/app/models/user.rb

    def generate_unique_session_token
        loop do
            session_token = SecureRandom::urlsafe_base64(6)
            return unless User.exists?(session_token: session_token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]

    def reset_session_token
        self.session_token = generate_unique_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-06-16 16:06:53.333428"], ["id", 5]]