reddit_clone/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @users = User.all

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Manel"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2023-06-16 16:05:53.218329"], ["updated_at", "2023-06-16 16:05:53.218329"]]
---
    def create
        @user = User.new(params_users)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @user = User.find(params[:id])